import math

'''
В рамках данного файла реализуются функции вычисления 
площади и периметра круга по заданному радиусу 
'''

def area(r):
    '''
    Возвращает площадь круга с заданным радиусом

        Параметры:
            r (float): значение радиуса
        
        Возвращаемое значение:
            (float): площадь круга

        Пример вызова:
            >>> area(3)
            28.274333882308138
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает периметр круга с заданным радиусом

        Параметры:
            r (float): значение радиуса
        
        Возвращаемое значение:
            (float): периметр круга

        Пример вызова:
            >>> perimeter(3)
            18.84955592153876
    '''
    return 2 * math.pi * r
