'''
В рамках данного файла реализуются функции вычисления 
площади и периметра прямоугольника по заданным сторонам 
'''

def area(a, b): 
    '''
    Возвращает площадь прямоугольника с заданными сторонами

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника
        
        Возвращаемое значение:
            (float): площадь прямоугольника

        Пример вызова:
            >>> area(3, 4)
            12
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Возвращает периметр прямоугольника с заданными сторонами

        Параметры:
            a (float): длина прямоугольника
            b (float): ширина прямоугольника
        
        Возвращаемое значение:
            (float): периметр прямоугольника

        Пример вызова:
            >>> perimeter(3, 4)
            14
    '''
    return (a + b) * 2