'''
В рамках данного файла реализуются функции вычисления 
площади и периметра квадрата по заданной стороне 
'''

def area(a):
    '''
    Возвращает площадь квадрата с заданными сторонами

        Параметры:
            a (float): длина стороны квадрата
        
        Возвращаемое значение:
            (float): площадь квадрата

        Пример вызова:
            >>> area(3)
            9
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата с заданными сторонами

        Параметры:
            a (float): длина стороны квадрата
        
        Возвращаемое значение:
            (float): периметр квадрата

        Пример вызова:
            >>> area(3)
            12
    '''
    return 4 * a
