'''
В рамках данного файла реализуются функции вычисления 
площади и периметра треугольника по заданным сторонам 
и высоте
'''

def area(a, h): 
    '''
    Возвращает площадь треугольника с заданной стороной и высотой

        Параметры:
            a (float): длина стороны треугольника
            h (float): длина высоты к данной стороне
        
        Возвращаемое значение:
            (float): площадь треугольника

        Пример вызова:
            >>> area(3, 4)
            6
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Возвращает периметр треугольника с заданной стороной и высотой

        Параметры:
            a (float): длина первой стороны треугольника
            b (float): длина второй стороны треугольника
            c (float): длина третьей стороны треугольника
        
        Возвращаемое значение:
            (float): периметр треугольника

        Пример вызова:
            >>> area(3, 4, 5)
            12
    '''
    return a + b + c 